Revit 2027 API
EnergyDataSettings.CheckRangeOfPercentageSkylights Method
Note: This API is now obsolete.
 Checks that the percentage skylights value is between 0.00 and 0.95.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
public static bool CheckRangeOfPercentageSkylights(
	double percentageSkylights
)
<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>
Public Shared Function CheckRangeOfPercentageSkylights (
	percentageSkylights As Double
) As Boolean
public:
[ObsoleteAttribute(L"Deprecated in Revit 2027 and may be removed in a later version of Revit.")]
static bool CheckRangeOfPercentageSkylights(
	double percentageSkylights
)
[<ObsoleteAttribute("Deprecated in Revit 2027 and may be removed in a later version of Revit.")>]
static member CheckRangeOfPercentageSkylights :
        percentageSkylights : float -> bool
Parameters
percentageSkylights Double
 The percentage skylights to be checked.
Return Value
Boolean
 True if the percentage skylights value is between 0.00 and 0.95, false otherwise.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace